---
kind: other
id: Methods.T:Autodesk.Revit.DB.ConnectorElement
source: html/02b3c992-e6e2-2b55-52c5-24c3c1da63e1.htm
---
# ConnectorElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.